config.org
#+TITLE: Doom Emacs configuration
#+AUTHOR: Laurent Lejeune
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../org/styles/org.css"/>

* Introduction

This uses the [[https://github.com/doomemacs/doomemacs][doom-emacs]] configuration framework which provides sane defaults,
hence this personal config file is pretty minimal in itself.

* General Bindings

#+begin_src emacs-lisp :tangle yes
(map! :leader
    :desc "Kill buffer" "x" #'kill-current-buffer
    :desc "Switch buffer (Persp.)" "." #'persp-switch-to-buffer
    :desc "Switch buffer" ">" #'switch-to-buffer
    :desc "Expand region" "e" #'er/expand-region
    :desc "Increase font size" "+" #'doom/increase-font-size
    :desc "Decrease font size" "-" #'doom/decrease-font-size
    :desc "Next buffer" "k" #'next-buffer
    :desc "Previous buffer" "j" #'previous-buffer
    :desc "Search buffer" "/" #'+default/search-buffer
    :desc "Search buffer" "ps" #'+default/search-project
    :desc "Switch window" "TAB" #'ace-window
    :desc "Open URL" "gx" #'browse-url-at-point)
#+end_src

#+begin_src emacs-lisp :tangle yes
(define-key evil-normal-state-map (kbd "H") 'centaur-tabs-backward)
(define-key evil-normal-state-map (kbd "L") 'centaur-tabs-forward)
#+end_src

Evil-mode does not conform precisely to vim's standard keybinding.
We reset these here:
#+begin_src emacs-lisp :tangle yes
(define-key evil-normal-state-map (kbd "C-a") 'evil-numbers/inc-at-pt)
(define-key evil-normal-state-map (kbd "C-x") 'evil-numbers/dec-at-pt)
#+end_src

Function that allow to move around selections:
#+begin_src emacs-lisp :tangle yes
(define-key evil-visual-state-map (kbd "K") 'drag-stuff-up)
(define-key evil-visual-state-map (kbd "J") 'drag-stuff-down)
#+end_src

* Appearance
Colors and fonts
#+begin_src emacs-lisp :tangle yes
;; `gruvbox-material' contrast and palette options
;; (setq doom-gruvbox-material-background  "medium"  ; or hard (defaults to soft)
;;      doom-gruvbox-material-palette     "original") ; or original (defaults to material)

;; set `doom-theme'
(setq doom-theme 'doom-gruvbox-material) ; dark variant

(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 20 :height 1.0 :weight 'normal))
(setq truncate-lines 'nil)
#+end_src

Indentation guides
#+begin_src emacs-lisp :tangle yes
(setq highlight-indent-guides-auto-odd-face-perc 50)
(setq highlight-indent-guides-auto-even-face-perc 50)
(setq highlight-indent-guides-auto-character-face-perc 50)
;; (setq highlight-indent-guides-method 'character)
(setq highlight-indent-guides-responsive 'top)

(setq display-line-numbers-type 'relative)
#+end_src

Patch theme to use different font sizes in org headings.

#+begin_src emacs-lisp :tangle yes
(custom-theme-set-faces!
    'doom-dracula
        '(org-level-4 :inherit outline-4 :height 1.0)
        '(org-level-3 :inherit outline-3 :height 1.1)
        '(org-level-2 :inherit outline-2 :height 1.3)
        '(org-level-1 :inherit outline-1 :height 1.5)
        '(org-document-title :height 1.5 :underline nil))
#+end_src

Hide emphasis markups mark.
#+begin_src emacs-lisp :tangle yes
(setq org-hide-emphasis-markers t)
#+end_src

Show emphasis marker when cursor is on region.

#+begin_src emacs-lisp :tangle yes
(use-package! org-appear
  :defer t
  :config
  (setq org-appear-autolinks t))
(add-hook! org-mode :append #'org-appear-mode)
#+end_src

Force company to use fixed-pitch font
#+begin_src emacs-lisp :tangle yes
(use-package! company
  :defer t
  :custom-face
  (company-tooltip
   ((t (:family "JetBrainsMono Nerd Font" :height 1.0))))
  :config
        (define-key evil-insert-state-map (kbd "C-l") 'company-complete)
        (setq company-idle-delay 0.1)
        (setq company-tooltip-idle-delay 0.1)
        (add-to-list '+lsp-company-backends 'company-files)
        (set-company-backend! 'org-mode 'company-files 'company-capf)
)
#+end_src


* LaTeX
Bind main AucTex menu:

#+begin_src emacs-lisp :tangle yes
(map! :localleader
      :map LaTeX-mode-map
      :desc "Master"    "m" 'TeX-command-master)
#+end_src

Setup default compilation engine.

- The first element of the list is the symbol that AucTeX recognizes.
- The second element is a string with the name of the TeX distribution.
- The third element is the shell command for compiling plain TeX documents.
- The fourth element is the shell command for compiling LaTeX documents.
   Here we are assuming the user is using a Tectonic project (generated using ~tectonic -X new <proj-name>~).
- The last element is the shell command for compiling ConTeXt documents, left unconfigured for now.

#+begin_src emacs-lisp :tangle yes
(setq TeX-engine-alist '((default
                          "Tectonic"
                          "tectonic -X compile -f plain %T"
                          "tectonic -X watch"
                          nil)))
#+end_src

Next, modify the ~LaTeX-command-style~ so that AucTex doesn’t add extra options to it that Tectonic does not recognize.
We simply set it to the ~%(latex)~ expansion (from ~TeX-expand-list-builtin~), removing any other extra options.

#+begin_src emacs-lisp :tangle yes
(setq LaTeX-command-style '(("" "%(latex)")))
#+end_src

We need to set the ~TeX-check-TeX~ variable to ~nil~ since AucTeX will try to find a traditional distribution like ~TeXLive~ or others, and will fail since Tectonic doesn’t meet its criteria.

Additionally, we should also set ~TeX-process-asynchronous~ to ~t~, so that running Tectonic in watch mode doesn’t hang up Emacs.

We’ll also just ensure that the ~TeX-engine~ is set to ~default~.

#+begin_src emacs-lisp :tangle yes
(setq TeX-process-asynchronous t
      TeX-check-TeX nil
      TeX-engine 'default)
#+end_src

Finally, modify the ~TeX-command-list~ to use the appropriate commands and not pass in extra metadata and options to Tectonic that cause it to error out. This needs to be done in place.

#+begin_src emacs-lisp :tangle yes
(add-hook! LaTeX-mode
(let ((tex-list (assoc "TeX" TeX-command-list))
      (latex-list (assoc "LaTeX" TeX-command-list)))
  (setf (cadr tex-list) "%(tex)"
        (cadr latex-list) "%l")))
#+end_src

* Typopunct

#+begin_src emacs-lisp :tangle yes
(use-package! typopunct
  :defer t
  :config
  (typopunct-change-language 'french t))
  #+end_src

* Languagetool
Download standalone [[https://languagetool.org/][LanguageTool]] server from https://languagetool.org/download/LanguageTool-stable.zip and unzip, then set these variables:

#+begin_src emacs-lisp :tangle yes
(setq langtool-language-tool-jar (concat (getenv "HOME") "/bin/LanguageTool-5.2/languagetool-commandline.jar"))

(defun langtool-autoshow-detail-popup (overlays)
  (when (require 'popup nil t)
    ;; Do not interrupt current popup
    (unless (or popup-instances
                ;; suppress popup after type `C-g` .
                (memq last-command '(keyboard-quit)))
      (let ((msg (langtool-details-error-message overlays)))
        (popup-tip msg)))))
(setq langtool-autoshow-message-function
      'langtool-autoshow-detail-popup)

#+end_src

* YAML
#+begin_src emacs-lisp :tangle yes
(use-package! yaml-mode
  :defer t
  :mode ("\\.ya?ml\\'" . yaml-mode))
#+end_src

* Python
** Interpreter
#+begin_src emacs-lisp :tangle yes
(setq python-shell-interpreter "ipython"
    python-shell-interpreter-args "-i --simple-prompt")
#+end_src
** Executables
#+begin_src emacs-lisp :tangle yes
(add-hook 'python-mode-hook #'(lambda () (setq flycheck-checker 'python-pylint)))
#+end_src

** Breakpoints

Bindings and functions to add and highlight breakpoints.
#+begin_src emacs-lisp :tangle yes
(defvar python--pdb-breakpoint-string "breakpoint()")
(defun python-add-breakpoint ()
"Inserts a python breakpoint using `pdb'"
    (interactive)
    (back-to-indentation)
    ;; this preserves the correct indentation in case the line above
    ;; point is a nested block
    (split-line)
    (insert python--pdb-breakpoint-string)
    (python-set-debug-highlight))


(defun python-set-debug-highlight ()
    (interactive)
    (highlight-lines-matching-regexp "breakpoint[.]?" 'hi-red-b))

(defun python-add-debug-highlight ()
    "Adds a highlighter for use by `python--pdb-breakpoint-string'"
    (interactive)
    (python-set-debug-highlight))
    (add-hook 'python-mode-hook 'python-add-debug-highlight)

(map! :localleader
      :map python-mode-map
      :desc "Insert breakpoint"    "d" 'python-add-breakpoint)
#+end_src

** Docstrings

Generate numpy-style docstring automatically from function definition
with [[https://github.com/douglasdavis/numpydoc.el][numpydoc.el]].

#+begin_src emacs-lisp :tangle yes
(use-package! numpydoc
  :defer t
  :init
  (setq numpydoc-insertion-style 'yas))

(map! :localleader
      :map python-mode-map
      :desc "Auto docstring"  "s" 'numpydoc-generate)
#+end_src

Enable pyright and ruff LSP servers for python-mode

#+begin_src emacs-lisp :tangle yes
(after! lsp-mode
  ;; Ensure python-mode uses lsp
  (add-hook 'python-mode-hook #'lsp)

  ;; Prevent doom from disabling one or the other
  (setq lsp-disabled-clients '())

  ;; Register ruff-lsp as an additional client
  (lsp-register-client
   (make-lsp-client
    :new-connection (lsp-stdio-connection '("ruff lsp"))
    :major-modes '(python-mode)
    :server-id 'ruff-lsp
    :add-on? t))) ;; <-- important! allows both Pyright + Ruff

#+end_src

Format using ruff before save
#+begin_src emacs-lisp :tangle yes
;; (after! python
;;   (setq +format-with-lsp nil) ;; disable LSP formatting if any
;;   (add-hook 'before-save-hook
;;             (lambda ()
;;               (when (eq major-mode 'python-mode)
;;                 (call-process "ruff" nil nil nil "format" (buffer-file-name)))
;;               nil)))
#+end_src

