config.org
* Docker
Disable format-on-save in docker-mode.
This is acting funny when dealing with ~FROM~ instructions.
#+begin_src emacs-lisp :tangle yes
(setq +format-on-save-disabled-modes (add-to-list '+format-on-save-disabled-modes 'dockerfile-mode))
#+end_src
* Golang
#+begin_src emacs-lisp :tangle yes
(setq lsp-go-use-gofumpt t)
#+end_src
* Harpoon
#+begin_src emacs-lisp :tangle yes
(map! :leader
      (:prefix-map ("r" . "Harpoon")
       (:desc "Menu" "m" #'harpoon-quick-menu-hydra
        :desc "Add file" "a" #'harpoon-add-file
        :desc "Edit file" "r" #'harpoon-toggle-file
        :desc "Clear" "c" 'harpoon-clear)))

(map! :leader "1" 'harpoon-go-to-1)
(map! :leader "2" 'harpoon-go-to-2)
(map! :leader "3" 'harpoon-go-to-3)
(map! :leader "4" 'harpoon-go-to-4)
(map! :leader "5" 'harpoon-go-to-5)
(map! :leader "6" 'harpoon-go-to-6)
(map! :leader "7" 'harpoon-go-to-7)
(map! :leader "8" 'harpoon-go-to-8)
(map! :leader "9" 'harpoon-go-to-9)
(map! :leader "0" 'harpoon-go-to-10)
#+end_src
* Org

#+begin_src emacs-lisp :tangle yes
(setq org-export-use-babel t)
(setq org-directory "~/org/")
(load-library "ox-reveal")
(setq org-latex-pdf-process '("tectonic %f"))
(setq org-export-in-background t)
#+end_src

Set PDF viewer.
#+begin_src emacs-lisp :tangle yes
(add-to-list 'org-file-apps '("\\.pdf\\'" . "zathura %s"))
#+end_src

#+begin_src emacs-lisp :tangle yes
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

** Backends/Exporters

A couple custom LaTeX classes.

#+begin_src emacs-lisp :tangle yes
(after! ox-latex
    (add-to-list 'org-latex-classes
                '("koma-article" "\\documentclass{scrartcl}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

    (add-to-list 'org-latex-classes
                '("koma-article-fr" "\\documentclass[french]{scrartcl}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

    (add-to-list 'org-latex-classes
                '("memoir-fr"
                "\\documentclass[a4paper,11pt,titlepage, twoside]{memoir}
                    \\usepackage[utf8]{inputenc}
                    \\usepackage[T1]{fontenc}
                    \\usepackage{fixltx2e}
                    \\usepackage{hyperref}
                    \\usepackage{mathpazo}
                    \\usepackage{color}
                    \\usepackage{enumerate}
                    \\definecolor{bg}{rgb}{0.95,0.95,0.95}
                    \\tolerance=1000
                    \\linespread{1.1}
                    \\hypersetup{pdfborder=0 0 0}"
                ("\\chapter{%s}" . "\\chapter*{%s}")
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

    (add-to-list 'org-latex-classes
                '("TMI"
                "\\documentclass[journal, web, twoside]{ieeecolor}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

)
#+end_src


Detect french-style quotes when exporting

#+begin_src emacs-lisp :tangle no
(after! ox
    (setq fr-quotes '("fr"
                    (primary-opening :utf-8 "« " :html "&laquo;&nbsp;" :latex "\\enquote{" :texinfo "@guillemetleft{}@tie{}")
                    (primary-closing :utf-8 " »" :html "&nbsp;&raquo;" :latex "}" :texinfo "@tie{}@guillemetright{}")
                    (secondary-opening :utf-8 "« " :html "&laquo;&nbsp;" :latex "\\\enquote{" :texinfo "@guillemetleft{}@tie{}")
                    (secondary-closing :utf-8 " »" :html "&nbsp;&raquo;" :latex "\\}" :texinfo "@tie{}@guillemetright{}")
                    (apostrophe :utf-8 "’" :html "&rsquo;")))
    (add-to-list 'org-export-smart-quotes-alist fr-quotes))
#+end_src

Exporter for the [[https://github.com/posquit0/Awesome-CV][awesome-cv]] latex class.
#+begin_src emacs-lisp :tangle yes
(use-package! ox-awesomecv
  :after org)
#+end_src

When exporting to HTML, force code block background to use current theme color, otherwise,
things may end up not readable when using dark themes.

#+begin_src emacs-lisp :tangle yes
(defun my/org-inline-css-hook (exporter)
  "Insert custom inline css to automatically set the
background of code to whatever theme I'm using's background"
  (when (eq exporter 'html)
    (let* ((my-pre-bg (face-background 'default))
           (my-pre-fg (face-foreground 'default)))
      (setq
       org-html-head-extra
       (concat
        org-html-head-extra
        (format "<style type=\"text/css\">\n pre.src {background-color: %s; color: %s;}</style>\n"
                my-pre-bg my-pre-fg))))))

(add-hook 'org-export-before-processing-hook 'my/org-inline-css-hook)
#+end_src

** Org-ref / bibtex
- We define in ~org-ref-default-bibliography~ a default ~bib~ file.
- We use [[https://tectonic-typesetting.github.io/en-US/][tectonic]] to generate ~pdf~ files from LaTeX.
- When adding citations in popup buffer, finish by using *M-Enter*.

#+begin_src emacs-lisp :tangle yes
(use-package! org-ref
  :defer t
    :init
        (setq org-ref-bibliography-notes "~/org/paper-notes/paper-notes.org"
            org-ref-default-bibliography "~/org/refs.bib"
            bibtex-completion-bibliography org-ref-default-bibliography
            bibtex-completion-notes-path "~/org/paper-notes/paper-notes.org"
            bibtex-completion-pdf-open-function
                (lambda (fpath)
                (call-process "zathura" nil 0 nil fpath))))

(map! :localleader
      :map org-mode-map
      :desc "Insert citation" "c" 'org-cite-insert)
#+end_src

** Org-capture
#+begin_src emacs-lisp :tangle yes
(setq org-capture-templates
  (quote
   (("t" "todo" entry
     (file+headline "~/org/todo.org" "Tasks")
     "* TODO %U %?\n\n"
     :empty-lines-after 1)
    ("n" "note" entry
     (file+headline "~/org/notes.org" "Inbox")
     "* %U %? \n\n"
     :empty-lines-after 1))))
#+end_src


* Others

#+begin_src emacs-lisp :tangle yes
(after! counsel
  (setq counsel-rg-base-command "rg -M 240 --with-filename --no-heading --line-number --color never %s || true"))
#+end_src

#+begin_src emacs-lisp :tangle yes
(after! iflipb
  (setq iflipb-ignore-buffers "$^")
  )
#+end_src

Enable tree-sitter syntax highlighting for all languages.

#+begin_src emacs-lisp :tangle yes
(setq +tree-sitter-hl-enabled-modes t)
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq confirm-kill-emacs nil)
#+end_src

* TMUX

#+begin_src emacs-lisp :tangle yes
(defun tmux-sessionizer ()
  (interactive)
  (with-current-buffer
      (shell-command "tmux neww tmux-sessionizer")))
(map! :nvi "C-f" #'tmux-sessionizer)
#+end_src

* Notmuch

** Cheatsheet

*** Autocomplete addresses
By default, notmuch uses ~notmuch address~ to fetch all email addresses parsed until now.
Use ~<TAB>~ when writing an address in the "To" field to auto-complete.

*** Forwarding
Open email you want to forward and press ~c f~.

** Saved Searches

#+begin_src emacs-lisp :tangle yes
(setq ll/notmuch-default-query "tag:inbox AND not tag:deleted AND date:3months..")
(setq notmuch-saved-searches
    `((:name "inbox"
       :query ,ll/notmuch-default-query
       :key "i"
       :search-type: tree)
      (:name "sent"
       :query "tag:sent AND not tag:deleted")
      (:name "gmail"
       :query "tag:Gmail/Inbox AND not tag:deleted"
       :key "g"
       :search-type: tree)
      (:name "personal"
       :query "tag:Gandi/Inbox AND not tag:deleted"
       :key "p"
       :search-type tree)))
(setq +notmuch-mail-folder "~/.mail")
(setq +notmuch-sync-backend 'mbsync)
(setq +notmuch-home-function (lambda () (notmuch-search ll/notmuch-default-query)))
#+end_src

** My Identity

#+begin_src emacs-lisp :tangle yes
(setq notmuch-always-prompt-for-sender t)
(setq user-full-name "Laurent Lejeune")
(setq user-mail-address "me@lejeunel.org")
(setq mail-host-address "lejeunel.org")
#+end_src

** External Viewer
Use xdg-open to open attachments.
#+begin_src emacs-lisp :tangle yes
(after! notmuch
  (setq notmuch-show-part-action-list
        '(("Open with xdg-open" . (lambda (part) (start-process "xdg-open" nil "xdg-open" (notmuch-show-get-filename part))))
          ("View" . notmuch-show-view-part)
          ("Save" . notmuch-show-save-part))))
#+end_src

** MSMTP

If msmtp is passed the envelope address on the command line
it will automatically pick the matching account.
We want that emacs pass the envelope from.
There are overlapping configuration variables that control this,
and it's a little confusing, but setting these three works for me:

#+begin_src emacs-lisp :tangle yes
(setq mail-specify-envelope-from t)
(setq message-sendmail-envelope-from 'header)
(setq mail-envelope-from 'header)
#+end_src

