config.org
** Forwarding

This sets default "forward-to" subject. We simply preprend "Fwd: " to
the original subject.

#+begin_src emacs-lisp :tangle yes
(setq message-make-forward-subject-function 'message-forward-subject-fwd)
#+end_src

** Avoid Empty Subjects

This asks for a confirmation when sending an email with an empty subject.

#+begin_src emacs-lisp :tangle yes
(defun my-notmuch-mua-empty-subject-check ()
  "Request confirmation before sending a message with empty subject"
  (when (and (null (message-field-value "Subject"))
             (not (y-or-n-p "Subject is empty, send anyway? ")))
    (error "Sending message cancelled: empty subject.")))
(add-hook 'message-send-hook 'my-notmuch-mua-empty-subject-check)
#+end_src
